stations = ['渋谷', '表参道', '外苑前', '青山一丁目',
            '赤坂見附', '溜池山王', '虎人門', '新橋',
            '銀座', '京橋', '日本橋', '三越前', '神田',
            '末広町', '上野広小路', '上野', '稲荷町',
            '田原町', '浅草']
syoyo_time = [0, 2, 4, 5, 7, 9, 11, 13, 15, 17, 18,
              20, 22, 23, 25, 26, 28, 30, 31]
n = 0
k = 0

print('［銀座線]渋谷駅からの所要時間')
stations_in = input('駅名を入力：')

while k == 0 and n < 19:
    if stations_in == stations[n]:
        k = 1
    n = n + 1

print(stations_in, '駅は')
if k == 0:
    print('銀座線の停車駅ではありません')
else:
    print('渋谷駅から', syoyo_time[n-1],'分で到着します')